CREATE TABLE IF NOT EXISTS `logistics`
(
    `id`          INT          not null,
    `type`        int          not null,
    `content`     varchar(200) not null,
    `create_time` timestamp    not null default CURRENT_TIMESTAMP
) ENGINE = InnoDB
  DEFAULT CHARSET = utf8;


insert into logistics (id, type, content, create_time)
values (12301, 0, '订单支付成功', '2020-05-31 17:06:06'),
       (12301, 0, '商家4号收到下单信息,正在配货', '2020-05-31 18:07:06'),
       (12301, 1, '中转仓收到商家4号配货信息，准备派送', '2020-05-31 19:08:06'),
       (12301, 2, '派送中', '2020-05-31 20:09:06'),

       (12302, 0, '订单支付成功', '2020-05-31 17:09:06'),

       (12303, 0, '订单支付成功', '2020-05-31 17:09:06'),
       (12303, 0, '商家4号收到下单信息,正在配货', '2020-05-31 18:09:06'),
       (12303, 1, '中转仓收到商家4号配货信息，准备派送', '2020-05-31 19:09:06'),
       (12303, 2, '派送中', '2020-05-31 20:09:06'),

       (12304, 0, '订单支付成功', '2020-05-31 16:09:06'),
       (12304, 0, '商家4号收到下单信息，正在配货', '2020-05-31 17:09:06'),
       (12304, 1, '中转仓收到商家4号配货信息，准备派送', '2020-05-31 19:09:06'),
       (12304, 2, '派送中', '2020-05-31 20:09:06'),
       (12304, 3, '已签收', '2020-05-31 21:09:06'),

       (12305, 0, '订单支付成功', '2020-05-31 18:09:06'),
       (12305, 0, '商家4号收到下单信息，正在配货', '2020-05-31 19:09:06'),
       (12305, 1, '中转仓收到商家4号配货信息，准备派送', '2020-05-31 20:09:06'),
       (12305, 2, '派送中', '2020-05-31 21:09:06'),

       (12306, 0, '订单支付成功', '2020-05-31 18:09:06'),
       (12306, 0, '商家4号收到下单信息，正在配货', '2020-05-31 19:09:06'),
       (12306, 1, '中转仓收到商家4号配货信息，准备派送', '2020-05-31 20:09:06'),
       (12306, 2, '派送中', '2020-05-31 21:09:06')